OAT15_URANS_kOmegaSST_z1/system/FOResolutionIndex
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

    // resolutionIndex for assessing mesh quality: https://www.openfoam.com/news/main-news/openfoam-v2212/post-processing#turbulent_mesh_quality
    // for SA-DES we need to add a work-around: https://develop.openfoam.com/Development/openfoam/-/merge_requests/569
    /*
    turbulenceFields
    {
        type            turbulenceFields;
        libs            (fieldFunctionObjects);
        fields
        (
            k
        );

        executeControl  timeStep;
        executeInterval 1;
        writeControl    writeTime;
        timeStart        4e-3;
    }
    */

    nu
    {
        type            coded;
        libs            (utilityFunctionObjects);
        name            calculateNu;

        codeExecute
        #{
            volScalarField nu("nu", mesh().lookupObject<volScalarField>("thermo:mu") / mesh().lookupObject<volScalarField>("rho"));
            nu.write();
        #};

        executeControl   writeTime;
        executeInterval  1;
        writeControl     writeTime;
        writeInterval    1;
        timeStart        4e-3;
    }

    CelikNuIndex
    {
        type             resolutionIndex;
        libs             (fieldFunctionObjects);
        model            CelikNuIndex;
        result           CelikNuField;
        nu               "nu";
        executeControl   writeTime;
        executeInterval  1;
        writeControl     writeTime;
        writeInterval    1;
        timeStart        4e-3;
    }

    CelikEtaIndex
    {
        type             resolutionIndex;
        libs             (fieldFunctionObjects);
        model            CelikEtaIndex;
        result           CelikEtaField;
        nu               "nu";
        executeControl   writeTime;
        executeInterval  1;
        writeControl     writeTime;
        writeInterval    1;
        timeStart        4e-3;
    }


// ************************************************************************* //
