OAT15_URANS_kOmegaSST_z1/system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//- Maximum non-orthogonality allowed. Set to 180 to disable.
maxNonOrtho 85;

//20 or 4 will give different skewness using the mesh with dx 0.1

//- Max skewness allowed. Set to <0 to disable.
maxBoundarySkewness 2;	//Original 20 for better quality 4
maxInternalSkewness 2;

/*
maxNonOrtho 180;
maxBoundarySkewness -1;	
maxInternalSkewness -1;
*/

//  Set to 180 to disable.
maxConcave 80;

//  Set to very negative number (e.g. -1E30) to disable.
minVol 1e-10;

//- Minimum quality of the tet formed by the face-centre
//  and variable base point minimum decomposition triangles and
//  the cell centre. Set to very negative number (e.g. -1E30) to
//  disable.
//     <0 = inside out tet,
//      0 = flat tet
//      1 = regular tet
//  1e-15 (small positive) to enable tracking
// -1e+30 (large negative) for best layer insertion
//minTetQuality 1e-15;
minTetQuality -1e+30;

//- Minimum face area. Set to <0 to disable.
minArea -1;

minTwist 0.02;

minDeterminant 0.000001;

minFaceWeight 0.05;
//minFaceWeight 0.02;

minVolRatio 0.01;

minTriangleTwist -1;

//minVolCollapseRatio 0.1;

// ************************************************************************* //
